gui_start
read_file -format verilog {/home/ncku_class/vsd2023/vsd202370/finalproject/Synthesis/CPU.v}
current_design CPU
create_clock -name "clk" -period 10 -waveform { 5 10  }  { clk  }
set_operating_conditions -min_library fast -min fast  -max_library slow -max slow
set_driving_cell  -lib_cell DFFX2  -library slow  -dont_scale  -no_design_rule  { {inst_F[6]} {ld_data_M[18]} {inst_F[21]} {ld_data_M[14]} {ld_data_M[29]} {inst_F[12]} {ld_data_M[7]} {ld_data_M[25]} {inst_F[26]} {ld_data_M[3]} {ld_data_M[11]} {inst_F[7]} {inst_F[31]} {ld_data_M[22]} {inst_F[13]} {inst_F[3]} {ld_data_M[19]} {inst_F[22]} {inst_F[17]} {ld_data_M[15]} {ld_data_M[8]} {inst_F[0]} {ld_data_M[26]} {ld_data_M[4]} {ld_data_M[12]} {inst_F[23]} {ld_data_M[0]} {inst_F[8]} {inst_F[27]} {inst_F[14]} {inst_F[4]} {inst_F[18]} {ld_data_M[16]} {ld_data_M[30]} {ld_data_M[9]} {ld_data_M[27]} {inst_F[10]} {ld_data_M[5]} {inst_F[1]} {ld_data_M[23]} {inst_F[24]} {ld_data_M[1]} {inst_F[28]} {inst_F[15]} {inst_F[9]} {ld_data_M[20]} {inst_F[5]} rst {inst_F[19]} {ld_data_M[17]} {inst_F[20]} {ld_data_M[31]} {ld_data_M[13]} {ld_data_M[28]} {inst_F[11]} {ld_data_M[6]} {inst_F[2]} {ld_data_M[24]} {inst_F[25]} {ld_data_M[2]} {ld_data_M[10]} {inst_F[29]} {inst_F[16]} {inst_F[30]} {ld_data_M[21]} }
set_input_delay -clock clk  -max -rise 1 "{inst_F[6]} {ld_data_M[18]} {inst_F[21]} {ld_data_M[14]} {ld_data_M[29]} {inst_F[12]} {ld_data_M[7]} {ld_data_M[25]} {inst_F[26]} {ld_data_M[3]} {ld_data_M[11]} {inst_F[7]} {inst_F[31]} {ld_data_M[22]} {inst_F[13]} {inst_F[3]} {ld_data_M[19]} {inst_F[22]} {inst_F[17]} {ld_data_M[15]} {ld_data_M[8]} {inst_F[0]} {ld_data_M[26]} {ld_data_M[4]} {ld_data_M[12]} {inst_F[23]} {ld_data_M[0]} {inst_F[8]} {inst_F[27]} {inst_F[14]} {inst_F[4]} {inst_F[18]} {ld_data_M[16]} {ld_data_M[30]} {ld_data_M[9]} {ld_data_M[27]} {inst_F[10]} {ld_data_M[5]} {inst_F[1]} {ld_data_M[23]} {inst_F[24]} {ld_data_M[1]} {inst_F[28]} {inst_F[15]} {inst_F[9]} {ld_data_M[20]} {inst_F[5]} rst {inst_F[19]} {ld_data_M[17]} {inst_F[20]} {ld_data_M[31]} {ld_data_M[13]} {ld_data_M[28]} {inst_F[11]} {ld_data_M[6]} {inst_F[2]} {ld_data_M[24]} {inst_F[25]} {ld_data_M[2]} {ld_data_M[10]} {inst_F[29]} {inst_F[16]} {inst_F[30]} {ld_data_M[21]}"
set_input_delay -clock clk -max -fall 1 "{inst_F[6]} {ld_data_M[18]} {inst_F[21]} {ld_data_M[14]} {ld_data_M[29]} {inst_F[12]} {ld_data_M[7]} {ld_data_M[25]} {inst_F[26]} {ld_data_M[3]} {ld_data_M[11]} {inst_F[7]} {inst_F[31]} {ld_data_M[22]} {inst_F[13]} {inst_F[3]} {ld_data_M[19]} {inst_F[22]} {inst_F[17]} {ld_data_M[15]} {ld_data_M[8]} {inst_F[0]} {ld_data_M[26]} {ld_data_M[4]} {ld_data_M[12]} {inst_F[23]} {ld_data_M[0]} {inst_F[8]} {inst_F[27]} {inst_F[14]} {inst_F[4]} {inst_F[18]} {ld_data_M[16]} {ld_data_M[30]} {ld_data_M[9]} {ld_data_M[27]} {inst_F[10]} {ld_data_M[5]} {inst_F[1]} {ld_data_M[23]} {inst_F[24]} {ld_data_M[1]} {inst_F[28]} {inst_F[15]} {inst_F[9]} {ld_data_M[20]} {inst_F[5]} rst {inst_F[19]} {ld_data_M[17]} {inst_F[20]} {ld_data_M[31]} {ld_data_M[13]} {ld_data_M[28]} {inst_F[11]} {ld_data_M[6]} {inst_F[2]} {ld_data_M[24]} {inst_F[25]} {ld_data_M[2]} {ld_data_M[10]} {inst_F[29]} {inst_F[16]} {inst_F[30]} {ld_data_M[21]}"
set_input_delay -clock clk -min -rise 0.2 "{inst_F[6]} {ld_data_M[18]} {inst_F[21]} {ld_data_M[14]} {ld_data_M[29]} {inst_F[12]} {ld_data_M[7]} {ld_data_M[25]} {inst_F[26]} {ld_data_M[3]} {ld_data_M[11]} {inst_F[7]} {inst_F[31]} {ld_data_M[22]} {inst_F[13]} {inst_F[3]} {ld_data_M[19]} {inst_F[22]} {inst_F[17]} {ld_data_M[15]} {ld_data_M[8]} {inst_F[0]} {ld_data_M[26]} {ld_data_M[4]} {ld_data_M[12]} {inst_F[23]} {ld_data_M[0]} {inst_F[8]} {inst_F[27]} {inst_F[14]} {inst_F[4]} {inst_F[18]} {ld_data_M[16]} {ld_data_M[30]} {ld_data_M[9]} {ld_data_M[27]} {inst_F[10]} {ld_data_M[5]} {inst_F[1]} {ld_data_M[23]} {inst_F[24]} {ld_data_M[1]} {inst_F[28]} {inst_F[15]} {inst_F[9]} {ld_data_M[20]} {inst_F[5]} rst {inst_F[19]} {ld_data_M[17]} {inst_F[20]} {ld_data_M[31]} {ld_data_M[13]} {ld_data_M[28]} {inst_F[11]} {ld_data_M[6]} {inst_F[2]} {ld_data_M[24]} {inst_F[25]} {ld_data_M[2]} {ld_data_M[10]} {inst_F[29]} {inst_F[16]} {inst_F[30]} {ld_data_M[21]}"
set_input_delay -clock clk  -min -fall 0.2 "{inst_F[6]} {ld_data_M[18]} {inst_F[21]} {ld_data_M[14]} {ld_data_M[29]} {inst_F[12]} {ld_data_M[7]} {ld_data_M[25]} {inst_F[26]} {ld_data_M[3]} {ld_data_M[11]} {inst_F[7]} {inst_F[31]} {ld_data_M[22]} {inst_F[13]} {inst_F[3]} {ld_data_M[19]} {inst_F[22]} {inst_F[17]} {ld_data_M[15]} {ld_data_M[8]} {inst_F[0]} {ld_data_M[26]} {ld_data_M[4]} {ld_data_M[12]} {inst_F[23]} {ld_data_M[0]} {inst_F[8]} {inst_F[27]} {inst_F[14]} {inst_F[4]} {inst_F[18]} {ld_data_M[16]} {ld_data_M[30]} {ld_data_M[9]} {ld_data_M[27]} {inst_F[10]} {ld_data_M[5]} {inst_F[1]} {ld_data_M[23]} {inst_F[24]} {ld_data_M[1]} {inst_F[28]} {inst_F[15]} {inst_F[9]} {ld_data_M[20]} {inst_F[5]} rst {inst_F[19]} {ld_data_M[17]} {inst_F[20]} {ld_data_M[31]} {ld_data_M[13]} {ld_data_M[28]} {inst_F[11]} {ld_data_M[6]} {inst_F[2]} {ld_data_M[24]} {inst_F[25]} {ld_data_M[2]} {ld_data_M[10]} {inst_F[29]} {inst_F[16]} {inst_F[30]} {ld_data_M[21]}"
set_output_delay -clock clk  -max -rise 1 "{rs2_data_M[2]} {aluout16_M[4]} {M_dm_w_en[3]} {pcaddress16[10]} {rs2_data_M[15]} {rs2_data_M[25]} {pcaddress16[5]} {aluout16_M[13]} {aluout16_M[5]} {rs2_data_M[7]} {pcaddress16[11]} {rs2_data_M[16]} {rs2_data_M[26]} {pcaddress16[6]} {aluout16_M[14]} {rs2_data_M[0]} {aluout16_M[6]} {rs2_data_M[8]} {pcaddress16[12]} {rs2_data_M[17]} {rs2_data_M[27]} {pcaddress16[3]} {aluout16_M[15]} {F_im_w_en[0]} {rs2_data_M[5]} {aluout16_M[7]} {pcaddress16[13]} {rs2_data_M[18]} {rs2_data_M[10]} {rs2_data_M[28]} {pcaddress16[4]} {rs2_data_M[20]} {F_im_w_en[1]} {rs2_data_M[6]} {rs2_data_M[30]} {aluout16_M[8]} {pcaddress16[14]} {rs2_data_M[19]} {aluout16_M[0]} {rs2_data_M[11]} {rs2_data_M[29]} {pcaddress16[9]} {rs2_data_M[21]} {pcaddress16[1]} {F_im_w_en[2]} {M_dm_w_en[0]} {rs2_data_M[3]} {rs2_data_M[31]} {aluout16_M[9]} {pcaddress16[15]} {aluout16_M[1]} {rs2_data_M[12]} {aluout16_M[10]} {rs2_data_M[22]} {pcaddress16[2]} {M_dm_w_en[1]} {rs2_data_M[4]} {F_im_w_en[3]} {aluout16_M[2]} {rs2_data_M[13]} {aluout16_M[11]} {pcaddress16[7]} {rs2_data_M[23]} {M_dm_w_en[2]} {rs2_data_M[1]} {aluout16_M[3]} {rs2_data_M[9]} {rs2_data_M[14]} {aluout16_M[12]} {pcaddress16[8]} {rs2_data_M[24]} {pcaddress16[0]}"
set_output_delay -clock clk -max -fall 1 "{rs2_data_M[2]} {aluout16_M[4]} {M_dm_w_en[3]} {pcaddress16[10]} {rs2_data_M[15]} {rs2_data_M[25]} {pcaddress16[5]} {aluout16_M[13]} {aluout16_M[5]} {rs2_data_M[7]} {pcaddress16[11]} {rs2_data_M[16]} {rs2_data_M[26]} {pcaddress16[6]} {aluout16_M[14]} {rs2_data_M[0]} {aluout16_M[6]} {rs2_data_M[8]} {pcaddress16[12]} {rs2_data_M[17]} {rs2_data_M[27]} {pcaddress16[3]} {aluout16_M[15]} {F_im_w_en[0]} {rs2_data_M[5]} {aluout16_M[7]} {pcaddress16[13]} {rs2_data_M[18]} {rs2_data_M[10]} {rs2_data_M[28]} {pcaddress16[4]} {rs2_data_M[20]} {F_im_w_en[1]} {rs2_data_M[6]} {rs2_data_M[30]} {aluout16_M[8]} {pcaddress16[14]} {rs2_data_M[19]} {aluout16_M[0]} {rs2_data_M[11]} {rs2_data_M[29]} {pcaddress16[9]} {rs2_data_M[21]} {pcaddress16[1]} {F_im_w_en[2]} {M_dm_w_en[0]} {rs2_data_M[3]} {rs2_data_M[31]} {aluout16_M[9]} {pcaddress16[15]} {aluout16_M[1]} {rs2_data_M[12]} {aluout16_M[10]} {rs2_data_M[22]} {pcaddress16[2]} {M_dm_w_en[1]} {rs2_data_M[4]} {F_im_w_en[3]} {aluout16_M[2]} {rs2_data_M[13]} {aluout16_M[11]} {pcaddress16[7]} {rs2_data_M[23]} {M_dm_w_en[2]} {rs2_data_M[1]} {aluout16_M[3]} {rs2_data_M[9]} {rs2_data_M[14]} {aluout16_M[12]} {pcaddress16[8]} {rs2_data_M[24]} {pcaddress16[0]}"
set_output_delay -clock clk -min -rise 0.1 "{rs2_data_M[2]} {aluout16_M[4]} {M_dm_w_en[3]} {pcaddress16[10]} {rs2_data_M[15]} {rs2_data_M[25]} {pcaddress16[5]} {aluout16_M[13]} {aluout16_M[5]} {rs2_data_M[7]} {pcaddress16[11]} {rs2_data_M[16]} {rs2_data_M[26]} {pcaddress16[6]} {aluout16_M[14]} {rs2_data_M[0]} {aluout16_M[6]} {rs2_data_M[8]} {pcaddress16[12]} {rs2_data_M[17]} {rs2_data_M[27]} {pcaddress16[3]} {aluout16_M[15]} {F_im_w_en[0]} {rs2_data_M[5]} {aluout16_M[7]} {pcaddress16[13]} {rs2_data_M[18]} {rs2_data_M[10]} {rs2_data_M[28]} {pcaddress16[4]} {rs2_data_M[20]} {F_im_w_en[1]} {rs2_data_M[6]} {rs2_data_M[30]} {aluout16_M[8]} {pcaddress16[14]} {rs2_data_M[19]} {aluout16_M[0]} {rs2_data_M[11]} {rs2_data_M[29]} {pcaddress16[9]} {rs2_data_M[21]} {pcaddress16[1]} {F_im_w_en[2]} {M_dm_w_en[0]} {rs2_data_M[3]} {rs2_data_M[31]} {aluout16_M[9]} {pcaddress16[15]} {aluout16_M[1]} {rs2_data_M[12]} {aluout16_M[10]} {rs2_data_M[22]} {pcaddress16[2]} {M_dm_w_en[1]} {rs2_data_M[4]} {F_im_w_en[3]} {aluout16_M[2]} {rs2_data_M[13]} {aluout16_M[11]} {pcaddress16[7]} {rs2_data_M[23]} {M_dm_w_en[2]} {rs2_data_M[1]} {aluout16_M[3]} {rs2_data_M[9]} {rs2_data_M[14]} {aluout16_M[12]} {pcaddress16[8]} {rs2_data_M[24]} {pcaddress16[0]}"
set_output_delay -clock clk  -min -fall 0.1 "{rs2_data_M[2]} {aluout16_M[4]} {M_dm_w_en[3]} {pcaddress16[10]} {rs2_data_M[15]} {rs2_data_M[25]} {pcaddress16[5]} {aluout16_M[13]} {aluout16_M[5]} {rs2_data_M[7]} {pcaddress16[11]} {rs2_data_M[16]} {rs2_data_M[26]} {pcaddress16[6]} {aluout16_M[14]} {rs2_data_M[0]} {aluout16_M[6]} {rs2_data_M[8]} {pcaddress16[12]} {rs2_data_M[17]} {rs2_data_M[27]} {pcaddress16[3]} {aluout16_M[15]} {F_im_w_en[0]} {rs2_data_M[5]} {aluout16_M[7]} {pcaddress16[13]} {rs2_data_M[18]} {rs2_data_M[10]} {rs2_data_M[28]} {pcaddress16[4]} {rs2_data_M[20]} {F_im_w_en[1]} {rs2_data_M[6]} {rs2_data_M[30]} {aluout16_M[8]} {pcaddress16[14]} {rs2_data_M[19]} {aluout16_M[0]} {rs2_data_M[11]} {rs2_data_M[29]} {pcaddress16[9]} {rs2_data_M[21]} {pcaddress16[1]} {F_im_w_en[2]} {M_dm_w_en[0]} {rs2_data_M[3]} {rs2_data_M[31]} {aluout16_M[9]} {pcaddress16[15]} {aluout16_M[1]} {rs2_data_M[12]} {aluout16_M[10]} {rs2_data_M[22]} {pcaddress16[2]} {M_dm_w_en[1]} {rs2_data_M[4]} {F_im_w_en[3]} {aluout16_M[2]} {rs2_data_M[13]} {aluout16_M[11]} {pcaddress16[7]} {rs2_data_M[23]} {M_dm_w_en[2]} {rs2_data_M[1]} {aluout16_M[3]} {rs2_data_M[9]} {rs2_data_M[14]} {aluout16_M[12]} {pcaddress16[8]} {rs2_data_M[24]} {pcaddress16[0]}"
set_wire_load_model -name tsmc18_wl10 -library slow
uplevel #0 check_design
compile -exact_map -map_effort high -area_effort high -power_effort high
uplevel #0 { report_timing -path full -delay max -nworst 1 -max_paths 1 -significant_digits 2 -sort_by group }
uplevel #0 { report_timing -path full -delay min -nworst 1 -max_paths 1 -significant_digits 2 -sort_by group }
uplevel #0 { report_area }
uplevel #0 { report_power -analysis_effort low }
write -hierarchy -format verilog -output /home/ncku_class/vsd2023/vsd202370/finalproject/vlsi期末決定版2/Synthesis/CPU_syn.v
write_sdf -version 1.0 -context verilog CPU_syn.sdf